/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：led.c
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：v1.0
* 作    者：lhb Steven
* 完成日期：2016/3/14
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#include "Led.h"
#include "Time.h"

#define LED_R   PC_ODR_ODR0
#define LED_G   PC_ODR_ODR1
#define LED_B   PC_ODR_ODR4 

#define LED_MODE PB_ODR_ODR6
/**********************************************函数定义***************************************************** 
* 函数名称: void LedInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: led初始化  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedInit(void) { 
    PB_DDR_DDR6 = 1;//状态指示灯
    PB_CR1_C16 = 1;
    PB_CR2_C26 = 0;
    
    PC_DDR_DDR0 = 1;//电量 RGB
    PC_CR1_C10 = 1;
    PC_CR2_C20 = 0;
    
    PC_DDR_DDR1 = 1;
    PC_CR1_C11 = 1;
    PC_CR2_C21 = 0;
    
    PC_DDR_DDR4 = 1;
    PC_CR1_C14 = 1;
    PC_CR2_C22 = 0;
    LedSetPower(0);//关闭led
    LED_MODE = 1;
    //LedSetPowerFlag(10);
    LedSetModeFlicker(2);//开机闪烁两下
    
    
//    PB_DDR_DDR6 = 0;//状态指示灯
//    PB_CR1_C16 = 0;
//    PB_CR2_C26 = 0;
//    
//    PC_DDR_DDR0 = 0;//电量 RGB
//    PC_CR1_C10 = 0;
//    PC_CR2_C20 = 0;
//    
//    PC_DDR_DDR1 = 0;
//    PC_CR1_C11 = 0;
//    PC_CR2_C21 = 0;
//    
//    PC_DDR_DDR4 = 0;
//    PC_CR1_C14 = 0;
//    PC_CR2_C22 = 0;
}
/***********************************************变量声明*****************************************************
* 功    能: 保存电量值  
* 作    者: by lhb_steven
* 日    期: 2016/3/17
************************************************************************************************************/ 
static u8 led_power_num = 0;
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetMode(u8 data) 
* 输入参数: u8 data 
* 返回参数: void  
* 功    能: 设置当前Led模式  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedSetMode(u8 data) { 
    led_power_num = data;
}
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetPower(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 设置电量状态  
* 作    者: by lhb_steven
* 日    期: 2016/3/14
************************************************************************************************************/ 
void LedSetPower(u8 cmd) { 
    switch( cmd ) {
        case 0:
        LED_R = 1;
        LED_G = 1;
        LED_B = 1;
        break;
        case 1:
        LED_R = 0;
        LED_G = 1;
        LED_B = 1;
        break;
        case 2:
        LED_R = 1;
        LED_G = 0;
        LED_B = 1;
        break;
        case 3:
        LED_R = 1;
        LED_G = 0;
        LED_B = 1;
        break;
        case 4:
        LED_R = 1;
        LED_G = 1;
        LED_B = 0;
        break;
        case 5:
        LED_R = 1;
        LED_G = 1;
        LED_B = 0;
        break;
        default:
        break;
    }
}
/***********************************************变量声明*****************************************************
* 功    能: 模式LED闪烁次数标志位  
* 作    者: by lhb_steven
* 日    期: 2016/3/17
************************************************************************************************************/ 
static u8 led_mode_flag = 2;
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetModeFlicker(u8 count) 
* 输入参数: u8 count 
* 返回参数: void  
* 功    能: 设置状态灯闪烁  count闪烁几次  
* 作    者: by lhb_steven
* 日    期: 2016/3/17
************************************************************************************************************/ 
void LedSetModeFlicker(u8 count) { 
    led_mode_flag = count;
}
/***********************************************变量声明*****************************************************
* 功    能: 警示灯闪烁次数状态标志位  
* 作    者: by lhb_steven
* 日    期: 2016/3/17
************************************************************************************************************/ 
static u8 led_power_flag = 0;
/**********************************************函数定义***************************************************** 
* 函数名称: void LedSetPowerFlag(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: 设置电池颜色显示  
* 作    者: by lhb_steven
* 日    期: 2016/3/17
************************************************************************************************************/ 
void LedSetPowerFlag(u8 data) { 
    led_power_flag = data;
}
/**********************************************函数定义***************************************************** 
* 函数名称: void LedTimeService(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能: LED动画的服务函数  
* 作    者: by lhb_steven
* 日    期: 2016/3/16
************************************************************************************************************/ 
void LedTimeService(void) { 
    static u16 time_count = 0;
    if(time_count < 20000) {
        time_count++;
    } else {
        time_count = 0;
        if(led_mode_flag > 0) {
            static u8 bit = 0;            
            if(bit == 0) {
                bit = 1;
                led_mode_flag--;
            } else {
                bit = 0;
            }
            LED_MODE = bit;
            TimerSetSec(0);
        } else {
            LED_MODE = 1;
        }
        if(led_power_flag > 0) {
            static u8 bit = 0;
            if(bit == 0) {
                bit = 1;
                led_power_flag--;
                LedSetPower(0);
            } else {
                bit = 0;
                LedSetPower(led_power_num);
            }
            TimerSetSec(0);
        }
    }
}










