/*******************************************************************************
* Copyright 2016 HangZhou 杭州久天科技有限公司
* All right reserved
*
* 文件名称：
*
* 文件标识：
* 摘    要：
*
*
* 当前版本：
* 作    者：lhb Steven
* 完成日期：2016/6/18
* 编译环境：C:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\stm8        
*
* 历史信息：
*******************************************************************************/
#ifndef __POWER_H
#define __POWER_H

#include "Type.h"


/**********************************************函数定义***************************************************** 
* 函数名称: void PowerInit(void) 
* 输入参数: void 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/6/18
************************************************************************************************************/ 
void PowerInit(void);
/**********************************************函数定义***************************************************** 
* 函数名称: void PowerSet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能: 设置后拨电源  
* 作    者: by lhb_steven
* 日    期: 2016/6/18
************************************************************************************************************/ 
void PowerSet(u8 cmd);

void PowerGet(void);

u8 BattertGetLevel(void);

/**********************************************函数定义***************************************************** 
* 函数名称: void PowerSetGet(u8 cmd) 
* 输入参数: u8 cmd 
* 返回参数: void  
* 功    能:   
* 作    者: by lhb_steven
* 日    期: 2016/6/18
************************************************************************************************************/ 
void PowerSetGet(u8 cmd);

#endif


